### 2.3 데이터 입출력

In [26]:
import numpy as up
import pandas as pd

- %%writefile 매직 명령어 ( 파이썬 명령어 아님, 주피터 명령어임)

In [36]:
%%writefile data/sample1.csv
c1, c2, c3
1,1.11, open
2,2.22, two
3,3.33, three

Overwriting data/sample1.csv

-# 레인보우 csv 를 설치하면 sample1 파일에 보기 편하게 컬럼별로 색이 칠해짐.

- CSV(comma-separated values)

In [37]:
df1 = pd.read_csv('data/sample1.csv')
df1

   c1    c2      c3
0   1  1.11    open
1   2  2.22     two
2   3  3.33   three

In [38]:
df1.columns

Index(['c1', ' c2', ' c3'], dtype='object')

In [39]:
%%writefile data/sample2.csv
c1, c2, c3
1,1.11, one
2,2.22, two
3,3.33, three

Overwriting data/sample2.csv

In [40]:
df2 = pd.read_csv('data/sample2.csv')
df2

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [43]:
df2 = pd.read_csv('data/sample2.csv', header=None)
df2

    0     1       2
0  c1    c2      c3
1   1  1.11     one
2   2  2.22     two
3   3  3.33   three

In [42]:
df2 = pd.read_csv('data/sample2.csv', names=['c1','c2','c3'])   # 컬럼명 지정
df2

   c1    c2      c3
0  c1    c2      c3
1   1  1.11     one
2   2  2.22     two
3   3  3.33   three

In [41]:
df1 = pd.read_csv('data/sample1.csv', index_col='c1')   # index column 지정
df1

      c2      c3
c1
1   1.11    open
2   2.22     two
3   3.33   three

- tsv(tab separated values)

In [33]:
%%writefile data/sample3.tsv
c1 c2 c3 c4
0.179181    -1.538472   1.347553    0.43381
1.024209    0.087307    -1.281997      0.49265
0.417899    -2.002308   0.255245     -1.10515

Overwriting data/sample3.tsv

In [34]:
df3 = pd.read_csv('data/sample3.tsv', sep='\s+')   # 파일에는 탭 문자 대신에 공백이 여러개 들어가있음
df3

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [35]:
df3 = pd.read_table('data/sample3.tsv', sep='\s+')
df3

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

- 여러줄의 헤더

In [44]:
%%writefile data/sample4.csv
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing data/sample4.csv

In [45]:
df4 = pd.read_csv('data/sample4.csv', skiprows=2)
df4

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

- 인코딩

In [47]:
df5 = pd.read_csv('data/경기도 성남시_인구및세대_현황_20230731.csv',encoding='EUC-KR')
df5.head(3)

,구별,동,인구수_계,인구수_남,인구수_여,19세 이상_계,19세 이상_남,19세 이상_여,65세 이상_계,65세 이상_남자,65세 이상_여자,세대수,재외국민,데이터기준일자
0,수정구,신흥1동,12955,6832,6123,12012,6350,5662,2790,1182,1608,7854,15,2023-07-31
1,수정구,신흥2동,19843,9637,10206,16890,8158,8732,3146,1445,1701,7628,33,2023-07-31
2,수정구,신흥3동,11034,5905,5129,10215,5489,4726,2304,1060,1244,6490,9,2023-07-31

- CSV 파일 출력

In [49]:
# index까지 저장되어, 추후 파일을 읽을 때 Unnamed: 0컬럼이 생긴다.
df4.to_csv('data/sample6.csv')          # to_csv하면 인덱스까지 저장이 됨.
pd.read_csv('data/sample6.csv')

   Unnamed: 0  c1    c2      c3
0           0   1  1.11     one
1           1   2  2.22     two
2           2   3  3.33   three

In [50]:
df4.to_csv('data/sample7.csv', index=False)    # 인덱스가 불필요하다면 index=False 로 지워버린다.      
pd.read_csv('data/sample7.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three